Revit 2027 API
NumberSystem.PlacementLevelId Property
 The id of the base level of stairs on which the NumberSystem is placed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LinkElementId PlacementLevelId { get; }
Public ReadOnly Property PlacementLevelId As LinkElementId
	Get
public:
property LinkElementId^ PlacementLevelId {
	LinkElementId^ get ();
}
member PlacementLevelId : LinkElementId with get
Property Value
LinkElementId
Remarks
 In multistory stairs, a stairs element could be a stair group or individual stair, this level could be the base level of group member or stairs element.
See Also
Reference
NumberSystem Class
Autodesk.Revit.DB Namespace